# Day 12: Pandas

- https://pandas.pydata.org/
- https://pandas.pydata.org/docs/getting_started/index.html

In [1]:
import pandas as pd
import numpy as np

### Example Questions

Q1. Create a Pandas Series from a Python list and perform basic operations like filtering, sorting, etc.

In [2]:
nums = [4, 8, 9, 2, 5, 7]
ser_nums = pd.Series(nums)
print(f"Series: \n{ser_nums}")
print(f"Filter by index:\n{ser_nums.filter(items= [0, 2, 4, 6])}")
print(f"Sort by values:\n{ser_nums.sort_values()}")
print(f"Power of 2:\n{ser_nums.pow(2)}")

Series:
0    4
1    8
2    9
3    2
4    5
5    7
dtype: int64
Filter by index:
0    4
2    9
4    5
dtype: int64
Sort by values:
3    2
0    4
4    5
5    7
1    8
2    9
dtype: int64
Power of 2:
0    16
1    64
2    81
3     4
4    25
5    49
dtype: int64

Q2. Read a CSV file into a Pandas DataFrame and perform basic data manipulation operations.

In [3]:
df = pd.read_csv("data/day_12/employees.csv")
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        20 non-null     object
 1   Age         20 non-null     int64
 2   Department  20 non-null     object
 3   Position    20 non-null     object
 4   Salary      20 non-null     int64
dtypes: int64(2), object(3)
memory usage: 932.0+ bytes

            Name  Age   Department           Position  Salary
0       John Doe   29  Engineering  Software Engineer   75000
1     Jane Smith   34    Marketing  Marketing Manager   68000
2  Alice Johnson   28           HR      HR Specialist   52000
3      Bob Brown   45      Finance         Accountant   60000
4  Charlie Davis   31  Engineering    DevOps Engineer   80000

In [4]:
df["Name"].groupby(df["Department"]).count()

Department
Engineering    6
Finance        4
HR             3
Marketing      4
Sales          3
Name: Name, dtype: int64

In [5]:
df.isnull().sum()

Name          0
Age           0
Department    0
Position      0
Salary        0
dtype: int64

Q3. Create a Pandas DataFrame from a dictionary and perform filtering and grouping operations.

In [6]:
employee_details = [
    {"Name": "John Doe", "Age": 29, "Department": "Engineering", "Position": "Software Engineer", "Salary": 75000},
    {"Name": "Jane Smith", "Age": 34, "Department": "Marketing", "Position": "Marketing Manager", "Salary": 68000},
    {"Name": "Alice Johnson", "Age": 28, "Department": "HR", "Position": "HR Specialist", "Salary": 52000},
    {"Name": "Bob Brown", "Age": 45, "Department": "Finance", "Position": "Accountant", "Salary": 60000},
    {"Name": "Charlie Davis", "Age": 31, "Department": "Engineering", "Position": "DevOps Engineer", "Salary": 80000},
    {"Name": "Emily White", "Age": 26, "Department": "Sales", "Position": "Sales Representative", "Salary": 45000},
    {"Name": "Frank Harris", "Age": 39, "Department": "Engineering", "Position": "Team Lead", "Salary": 90000},
    {"Name": "Grace Lee", "Age": 30, "Department": "Marketing", "Position": "Content Writer", "Salary": 50000},
]

emp_df = pd.DataFrame.from_dict(employee_details)
emp_df

            Name  Age   Department              Position  Salary
0       John Doe   29  Engineering     Software Engineer   75000
1     Jane Smith   34    Marketing     Marketing Manager   68000
2  Alice Johnson   28           HR         HR Specialist   52000
3      Bob Brown   45      Finance            Accountant   60000
4  Charlie Davis   31  Engineering       DevOps Engineer   80000
5    Emily White   26        Sales  Sales Representative   45000
6   Frank Harris   39  Engineering             Team Lead   90000
7      Grace Lee   30    Marketing        Content Writer   50000

In [7]:
emp_df.groupby(["Department", "Position"])["Salary"].mean().to_frame()

                                   Salary
Department  Position
Engineering DevOps Engineer       80000.0
            Software Engineer     75000.0
            Team Lead             90000.0
Finance     Accountant            60000.0
HR          HR Specialist         52000.0
Marketing   Content Writer        50000.0
            Marketing Manager     68000.0
Sales       Sales Representative  45000.0

In [8]:
filtered_by_age = emp_df[emp_df["Age"] > 30]
filtered_by_age

            Name  Age   Department           Position  Salary
1     Jane Smith   34    Marketing  Marketing Manager   68000
3      Bob Brown   45      Finance         Accountant   60000
4  Charlie Davis   31  Engineering    DevOps Engineer   80000
6   Frank Harris   39  Engineering          Team Lead   90000

### Practice Questions

1. Given a CSV file with student details, read it into a Pandas DataFrame and find the average age of students.

In [9]:
stud_df = pd.read_csv("data/day_12/students.csv")
stud_df.head()

            Name  Age  Grade Section
0  Alice Johnson   14      9       A
1      Bob Smith   15     10       B
2  Charlie Brown   13      8       C
3   Diana Prince   14      9       A
4     Ethan Hunt   15     10       B

In [10]:
stud_df["Age"].mean()

14.0

2. Implement a program that generates a Pandas Series with dates and filter it to get dates in specific range.

In [11]:
sales = [13, 45, 8, 2, 9, 17]
dates = pd.date_range(start= "2025-01-01", periods= len(sales), freq= "D")
ser_dates = pd.Series(data= sales, index= dates)
ser_dates

2025-01-01    13
2025-01-02    45
2025-01-03     8
2025-01-04     2
2025-01-05     9
2025-01-06    17
Freq: D, dtype: int64

3. Write a Python program that uses Pandas to read a CSV file and find the maximum and minimum values in each column.

In [12]:
sales_df = pd.read_csv("data/day_12/sales.csv", index_col= "Date")
sales_df.info()
sales_df.head()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, 2023-01-01 to 2023-01-10
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Product      10 non-null     object
 1   Region       10 non-null     object
 2   Salesperson  10 non-null     object
 3   Units Sold   10 non-null     int64
 4   Unit Price   10 non-null     float64
 5   Total Sales  10 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 560.0+ bytes

,Product,Region,Salesperson,Units Sold,Unit Price,Total Sales
Date,,,,,,
2023-01-01,Widget A,North,John Doe,10,25.0,250.0
2023-01-02,Widget B,South,Jane Smith,15,30.0,450.0
2023-01-03,Widget C,East,Emily Davis,8,20.0,160.0
2023-01-04,Widget A,West,Michael Brown,12,25.0,300.0
2023-01-05,Widget B,North,Chris Wilson,20,30.0,600.0

In [13]:
sales_df.max()

Product         Widget C
Region              West
Salesperson    Susan Lee
Units Sold            20
Unit Price          30.0
Total Sales        600.0
dtype: object

In [14]:
sales_df.min()

Product            Widget A
Region                 East
Salesperson    Chris Wilson
Units Sold                5
Unit Price             20.0
Total Sales           100.0
dtype: object

4. Create a function that takes a Pandas DataFrame and returns a new DataFrame with rows sorted in ascending order.

In [15]:
sales_df.sort_values("Salesperson")

,Product,Region,Salesperson,Units Sold,Unit Price,Total Sales
Date,,,,,,
2023-01-05,Widget B,North,Chris Wilson,20,30.0,600.0
2023-01-03,Widget C,East,Emily Davis,8,20.0,160.0
2023-01-09,Widget C,North,James Anderson,7,20.0,140.0
2023-01-02,Widget B,South,Jane Smith,15,30.0,450.0
2023-01-01,Widget A,North,John Doe,10,25.0,250.0
2023-01-08,Widget B,West,Linda Martinez,10,30.0,300.0
2023-01-04,Widget A,West,Michael Brown,12,25.0,300.0
2023-01-06,Widget C,South,Patricia Johnson,5,20.0,100.0
2023-01-07,Widget A,East,Robert Garcia,18,25.0,450.0
2023-01-10,Widget A,South,Susan Lee,14,25.0,350.0

In [16]:
sales_df.sort_values(by= "Units Sold", ascending= True, axis= 0)

,Product,Region,Salesperson,Units Sold,Unit Price,Total Sales
Date,,,,,,
2023-01-06,Widget C,South,Patricia Johnson,5,20.0,100.0
2023-01-09,Widget C,North,James Anderson,7,20.0,140.0
2023-01-03,Widget C,East,Emily Davis,8,20.0,160.0
2023-01-01,Widget A,North,John Doe,10,25.0,250.0
2023-01-08,Widget B,West,Linda Martinez,10,30.0,300.0
2023-01-04,Widget A,West,Michael Brown,12,25.0,300.0
2023-01-10,Widget A,South,Susan Lee,14,25.0,350.0
2023-01-02,Widget B,South,Jane Smith,15,30.0,450.0
2023-01-07,Widget A,East,Robert Garcia,18,25.0,450.0
2023-01-05,Widget B,North,Chris Wilson,20,30.0,600.0

In [17]:
def sort_df(old_df, col):
    new_df = old_df.sort_values(by= col, ascending= True)
    return new_df

new_sales_df = sort_df(sales_df, "Region")
new_sales_df

,Product,Region,Salesperson,Units Sold,Unit Price,Total Sales
Date,,,,,,
2023-01-03,Widget C,East,Emily Davis,8,20.0,160.0
2023-01-07,Widget A,East,Robert Garcia,18,25.0,450.0
2023-01-01,Widget A,North,John Doe,10,25.0,250.0
2023-01-05,Widget B,North,Chris Wilson,20,30.0,600.0
2023-01-09,Widget C,North,James Anderson,7,20.0,140.0
2023-01-02,Widget B,South,Jane Smith,15,30.0,450.0
2023-01-06,Widget C,South,Patricia Johnson,5,20.0,100.0
2023-01-10,Widget A,South,Susan Lee,14,25.0,350.0
2023-01-04,Widget A,West,Michael Brown,12,25.0,300.0
2023-01-08,Widget B,West,Linda Martinez,10,30.0,300.0

5. Given a Pandas DataFrame, filter the rows to include only the rows where a specific column meets a condition.

In [18]:
stud_df.head(10)

            Name  Age  Grade Section
0  Alice Johnson   14      9       A
1      Bob Smith   15     10       B
2  Charlie Brown   13      8       C
3   Diana Prince   14      9       A
4     Ethan Hunt   15     10       B
5    Fiona Davis   13      8       C
6  George Miller   14      9       A
7     Hannah Lee   15     10       B
8     Ian Wright   13      8       C
9  Julia Roberts   14      9       A

In [19]:
stud_df[stud_df["Section"] == "A"].head(10)

             Name  Age  Grade Section
0   Alice Johnson   14      9       A
3    Diana Prince   14      9       A
6   George Miller   14      9       A
9   Julia Roberts   14      9       A
12  Michael Scott   14      9       A
15   Paula Patton   14      9       A
18   Steve Rogers   14      9       A
21    Victor Hugo   14      9       A
24   Yara Shahidi   14      9       A
27     Bella Swan   14      9       A

6. Implement a program that reads a CSV file into a Pandas DataFrame and calculates the sum of a specific column.

In [20]:
sales_df = pd.read_csv("data/day_12/sales.csv")
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         10 non-null     object
 1   Product      10 non-null     object
 2   Region       10 non-null     object
 3   Salesperson  10 non-null     object
 4   Units Sold   10 non-null     int64
 5   Unit Price   10 non-null     float64
 6   Total Sales  10 non-null     float64
dtypes: float64(2), int64(1), object(4)
memory usage: 692.0+ bytes

In [21]:
total_sold_units = sales_df["Units Sold"].groupby(sales_df["Product"]).sum()
total_sold_units.to_frame()

          Units Sold
Product
Widget A          54
Widget B          45
Widget C          20

In [22]:
total_sales = sales_df["Total Sales"].sum()
print(f"Total sales: {total_sales}")

Total sales: 3100.0

7. Write a function that takes a Pandas DataFrame and adds a new calculated column to the DataFrame.

In [23]:
def add_col(old_df):
    old_df["Tax"] = old_df["Salary"] * old_df["Income Tax Rate"].apply(lambda x: x[:-1]).astype(int) / 100
    return old_df

tax_df = pd.read_csv("data/day_12/tax.csv")
tax_df.head()

            Name              Position  Salary Income Tax Rate
0       John Doe     Software Engineer   85000             22%
1     Jane Smith        Data Scientist   95000             24%
2  Alice Johnson       Product Manager  105000             24%
3      Bob Brown           UX Designer   78000             22%
4  Charlie Davis  System Administrator   67000             20%

In [24]:
tax_df = add_col(tax_df)
tax_df.head()

            Name              Position  Salary Income Tax Rate      Tax
0       John Doe     Software Engineer   85000             22%  18700.0
1     Jane Smith        Data Scientist   95000             24%  22800.0
2  Alice Johnson       Product Manager  105000             24%  25200.0
3      Bob Brown           UX Designer   78000             22%  17160.0
4  Charlie Davis  System Administrator   67000             20%  13400.0

8. Given a Pandas DataFrame, group the data by a specific column and calculate the mean of another column.

In [25]:
emp_df["Salary"].groupby(emp_df["Department"]).mean().round(3).to_frame()

                Salary
Department
Engineering  81666.667
Finance      60000.000
HR           52000.000
Marketing    59000.000
Sales        45000.000

9. Create a program that reads a JSON file into a Pandas DataFrame and extracts specific information from it.

In [26]:
import json
with open("data/day_12/sales.json") as f:
    data = json.load(f)

sales_json_df = pd.DataFrame(data["sales"]).set_index("id")
sales_json_df.head()

       product  quantity  price        date
id
1       Laptop         5   1200  2023-10-01
2   Smartphone        10    800  2023-10-02
3       Tablet         7    500  2023-10-03
4   Headphones        15    150  2023-10-04
5      Monitor         3    300  2023-10-05

10. Implement a funcion that takes a Pandas DataFrame and returns the transpose of the DataFrame.

In [27]:
def transpose_df(old_df):
    new_df = old_df.iloc[0].to_frame()
    for i in range(1, len(old_df.index)):
        new_df[i] = old_df.iloc[i].to_frame()
    return new_df

transposed_sales_df = transpose_df(sales_df)
transposed_sales_df

,0,1,2,3,4,5,6,7,8,9
Date,2023-01-01,2023-01-02,2023-01-03,2023-01-04,2023-01-05,2023-01-06,2023-01-07,2023-01-08,2023-01-09,2023-01-10
Product,Widget A,Widget B,Widget C,Widget A,Widget B,Widget C,Widget A,Widget B,Widget C,Widget A
Region,North,South,East,West,North,South,East,West,North,South
Salesperson,John Doe,Jane Smith,Emily Davis,Michael Brown,Chris Wilson,Patricia Johnson,Robert Garcia,Linda Martinez,James Anderson,Susan Lee
Units Sold,10,15,8,12,20,5,18,10,7,14
Unit Price,25.0,30.0,20.0,25.0,30.0,20.0,25.0,30.0,20.0,25.0
Total Sales,250.0,450.0,160.0,300.0,600.0,100.0,450.0,300.0,140.0,350.0

In [28]:
transposed_sales_df2 = sales_df.T
transposed_sales_df2

,0,1,2,3,4,5,6,7,8,9
Date,2023-01-01,2023-01-02,2023-01-03,2023-01-04,2023-01-05,2023-01-06,2023-01-07,2023-01-08,2023-01-09,2023-01-10
Product,Widget A,Widget B,Widget C,Widget A,Widget B,Widget C,Widget A,Widget B,Widget C,Widget A
Region,North,South,East,West,North,South,East,West,North,South
Salesperson,John Doe,Jane Smith,Emily Davis,Michael Brown,Chris Wilson,Patricia Johnson,Robert Garcia,Linda Martinez,James Anderson,Susan Lee
Units Sold,10,15,8,12,20,5,18,10,7,14
Unit Price,25.0,30.0,20.0,25.0,30.0,20.0,25.0,30.0,20.0,25.0
Total Sales,250.0,450.0,160.0,300.0,600.0,100.0,450.0,300.0,140.0,350.0